{
  "Product": "HP Laptop",
  "Reviews": [
    {
      "Title": "great laptop",
      "Author": "mcook",
      "ReviewID": "R3VDGNE7XJM5MN",
      "Overall": "5.0",
      "Content": "love the laptop. works good. for someone who is learning windows 8 it works pretty good trutorials to help you learn. would definitely reccommend it to others",
      "Date": "July 25, 2013"
    },
    {
      "Title": "Buy This in a Nearby BestBuy",
      "Author": "Nelson Blanco \"YoRazor185\"",
      "ReviewID": "RPYLQDU29J4JR",
      "Overall": "5.0",
      "Content": "I have boughten this in a near by BestBuy for about $400 and it came with more! It came with 4GB DD3 , covers, Windows 7&8 CD. To me it's wonderful. The computer is very responsive and the keyboard is slick and good feeling #No Homo :) LOL . Overall i do give it a 9/10  because it has a intergrated GPU. The GPU goes up to 2gb thats good but sometimes it fails and goes to 512mb of video memory",
      "Date": "June 20, 2013"
    },
    {
      "Title": "LOVE LOVE LOVE",
      "Author": "Ramiro Gonzalez",
      "ReviewID": "R5YLUL0RHAYV",
      "Overall": "5.0",
      "Content": "as i was reading the comments for this laptop many of them were negative so i was in between the line of should i get it or not.... when i opened the package it was perfect the color... super nice it did took about 10 minutes to set up your info but it was worth it WINDOWS 8 IS NOT BAD you get to customize your screen its perfect.....:) the camera is 720p its good but ive seen better ones OVERALL THE PC IS GREAT!!!!",
      "Date": "April 27, 2013"
    },
    {
      "Title": "efficient laptop",
      "Author": "Caroline Spooner",
      "ReviewID": "R1Q39C58RB97M",
      "Overall": "5.0",
      "Content": "I chose this rating because it is what I wanted and I love it .I would recommend it to everyone.",
      "Date": "May 9, 2013"
    },
    {
      "Title": "good notebook at agreat price",
      "Author": "booklover4life84",
      "ReviewID": "R3UMYWQKWT51LR",
      "Overall": "4.0",
      "Content": "I absolutely enjoy using this notebook pc, enough space to play your fav games and upload videos for youtube. I recommend this for anyone wanting a new computer at a reasonable price.",
      "Date": "December 26, 2012"
    },
    {
      "Title": "very thin and nice",
      "Author": "buggin4",
      "ReviewID": "RYPM4CB5OH10S",
      "Overall": "3.0",
      "Content": "A little slower than I thought. didnt know much about acc processor, really slow to my 15 yr old daughter.",
      "Date": "January 3, 2013"
    },
    {
      "Title": "new laptop for son",
      "Author": "John P. Shaffer \"Johnnie Pete\"",
      "ReviewID": "RW8DAXTNP9OS6",
      "Overall": "4.0",
      "Content": "Would love to say my son loves  this computer. Hate windows 8. You should have the option. My son still is not using this computer because windows 8 is not user friendly.",
      "Date": "July 27, 2013"
    },
    {
      "Title": "Working wonderfully!!!!!!",
      "Author": "Rev June Jeffries",
      "ReviewID": "R2AJEJ9C33GFTL",
      "Overall": "5.0",
      "Content": "I am using this laptop in my church for our media programs and it's working just wonderfully....It is just what we needed and the price was RIGHT !",
      "Date": "May 19, 2013"
    },
    {
      "Title": "HP Laptop",
      "Author": "L.B.",
      "ReviewID": "R17WQO7IN9IDLR",
      "Overall": "5.0",
      "Content": "This laptop is a sleek and lightweight product.  It has good speed and graphics.  For the price it is money worth spent.  It is affordable and very attractive.The seller was really great.  Any questions I had were quickly answered in a timely manner and very  friendly manner. I would recommend this laptop to anyone and would recommend this seller to anyone!",
      "Date": "April 29, 2013"
    },
    {
      "Title": "Love!!",
      "Author": "Tammula Tinker",
      "ReviewID": "R2DN1U522ERMLE",
      "Overall": "5.0",
      "Content": "I love this laptop! This is definitely a great pick. Runs excellent with Windows 8! A little confusing if you have no computer experience but once you grasp it is awesome!!!!!",
      "Date": "February 22, 2013"
    },
    {
      "Title": "Horrible!",
      "Author": "Keilee A.",
      "ReviewID": "R2H8449IH565J",
      "Overall": "1.0",
      "Content": "The first 24 hours it broke down and wouldn't download anything, no apps, no browsing, nothing I hate it. I sent it back and they refunded my money horrible computer!",
      "Date": "June 3, 2014"
    },
    {
      "Title": "worst pc i have ever purchased",
      "Author": "ron decline",
      "ReviewID": "RZYJ8OHKUWJ1X",
      "Overall": "1.0",
      "Content": "where to begin.this pc has so many things wrong with it.it's a lemon.it is slow as a turtle.it freezes constantly.can't even go to my control panel or my folders without it freezing.brand new and i have had to turn it off like over 100 times because when it freezes it never unfreezes.at 1.3 ghz speed i knew it woud be slow but not this slow.but the real problem is the freezing.also the finger pad is awful.it doesnt respond much of the time and when it does it usually opens up stuff im not trying to open.the audio is terrible.i had a 2009 hp pavilion that was great.awesome audio and no freezing and was very fast.you think hp could make a better laptop today than from 2009.but no.they have made one far worse.hp has lost my business with this piece of crap.and many others on here feel the same way.",
      "Date": "May 19, 2014"
    },
    {
      "Title": "Excellent system for 1998; I regret buying this",
      "Author": "rsd",
      "ReviewID": "R3LGERG2YJU60S",
      "Overall": "2.0",
      "Content": "We needed a new laptop, one that could withstand the wear and tear of everyday use in the home.  I needed this laptop for internet, email, basic Office functionality (primarily Excel and Word, occasionally Ppt), Itunes music interface with ipod, and we needed the HDMI port so we could stream to our tv.  We made the mistake of ordering this system with Win 8 instead of 7.  I can't say how much better the system would've functioned with 7, but I know it is barely operable with Win 8. Both Microsoft and HP should be ashamed that their product created such a perfect storm of frustration and crappy functioning.WIn 8 sucks.  Everyone knows it.  Everyone but MS employees will readily say so.  So I'm not going to waste a ton of time detailing why it's an extremely bad idea to put an OS designed for a touch screen on a lap top that does not have a touch screen.Let's talk updates.  When I configured Win 8 I clicked the setting that Win 8 is NOT allowed to install any updates without asking me first. I do not like too much running in the background without my knowledge.  So what happens?  LIKE AN ABUSIVE BOYFRIEND, WIN 8 will ask if I want to update and soon after I say \"no\", not yet,  MY MOUSE POINTER MAGICALLY FREEZES AND FUNCTIONALITY SLOWS TO A CRAWL as my system has a seizure.  I once waited 1/2 an hour for this to remedy itself.  It did not. Several times, my indicator for Norton Internet Security suddenly goes away or shows up as being deactivated (WTF?).  I was forced to alt+ctrl+del and restart. During shutdown, Windows suddenly decides that it's ok to begin installing that update that I previously turned down.  HOW FRIGGING CONVENIENT!  This happens EVERY DAMN UPDATE!HP isn't innocent either.  The HP support assistant is supposed to be a friendly interface there to let you know of updates that are ready, fixes you need, even basic maintenance suggestions (like a recovery set).  And it would probably be lovely if the damn thing didn't a) choke up all application functioning once a week when its dialog box pops on the scene to let me know what's up (weekly notification, you can't set it for longer terms), b) takes a full minute to open, and c) crashes itself 50% of the time during updates.This machine doesn't like to go to sleep and frequently goes into a mini-coma when you try to wake it up.  And god help you if you close the laptop, change your mind, and immediately try to open it again.  The screen will be off and you're going to be there for at least another 10 minutes waiting for the system to fully turn itself off and go to sleep, and then you have to wake it from its mini coma (a feat in and of itself) before you can get any kind of functionality back.Software and applications on the system take an extremely long (and unacceptable) amount of time to open, they periodically freeze up, and frequently crash.  Thanks to Win 8 itself the OS is very resistant to change and pulls out all the stops to prevent you from properly using other vendors' applications. -However, once you manage to get those apps installed, they work so much better that what comes on this piece of junk (thank you to Itunes, Foxit, and Outlook in particular).The inherent applications put on here to open files (Windows Media player, Mail, Live, etc), take forever to open and frequently need massaging to work.  -Yes, I remedied this by putting on my own applications that work better, but it took forever because Win 8 doesn't want you to change a thing.  It took forever for me to even dig up the right files in Win explorer to take out the crap I didn't want (and there is so very much crap loaded on here).All of these problems were there from day 1.  They can't be blamed on viruses or incompatible/competing software or me screwing with it.  Day frigging 1.  I was the fool who thought all systems had their problems and I could find fixes for these.  It's been a year and just as I solve one issue, another one opens.  My spouse has a mac in the den and can't even stand to use this laptop for anything at all.OH, and whatever you do, don't use Norton Internet Security on this machine.  Even though that's the free trial you get with the system, it practically destroys functionality in and of itself.  If you set it to do anything at all on your system (even the least invasive), it becomes a massive resource hog and can often shut down functionality itself.So this laptop + Win 8 + Norton = A really bad time.  You're signing on for an abusive relationship and lots of disappointment.Why did I give 2 stars instead of 1.  Very simple:  A) the HDMI port works as advertised and actually does send images to my tv beautifully (when I can get my streaming working that is), and B) I can honestly say that because of my experiences with this system my standards have dropped so incredibly low that as soon as I get my new laptop (which won't be HP or Win 8) I am going to be delighted into ecstasy.",
      "Date": "May 18, 2014"
    },
    {
      "Title": "My very first laptop... And it sucks.",
      "Author": "jennyahn",
      "ReviewID": "R2MA16GYSWT7TK",
      "Overall": "3.0",
      "Content": "I got this about 1.5 years ago. At first, it works great! That is, until you start to download some necessary apps. The computer starts to slow down and it's definitely not worth the money.About a 6 months ago, white lines started to appear on my monitor and they started to appear right after my warranty ended.This computer disappointed me. There is no way to fix it unless you spend $300 or more. I'd recommend that you spend a little more money and get a more reliable laptop than this.",
      "Date": "April 12, 2014"
    },
    {
      "Title": "HP",
      "Author": "Ari",
      "ReviewID": "R2RCZCC09SMD6I",
      "Overall": "4.0",
      "Content": "This is a very good computer. It gets the job done everyday for a student like me but I do have some problems with this computer:- It's starting to get slow- The touchpad doesn't always respond-It freezes sometimes for no reason- Lastly windows 8 is slow at times-May be harder to use for some people who aren't tech savvy- Could have better speakersPROS:- Windows 8 is smooth to use- Computer response time is fast- Easier layout- More customization options-Good Battery LifeI love windows 8 though because everything is very organized on a different type of start menu. The layout is great even though sometimes my friends and teachers don't know how to use it. It didn't take me that long to get adjusted. I believe that this is a great computer overall, but I'm sure that there are much better computers out there than this one. I'm just glad that I was able to find a good computer for under $300 on my highschool budget.",
      "Date": "April 11, 2014"
    },
    {
      "Title": "ok for games",
      "Author": "carmen",
      "ReviewID": "RZ3O80HCVICXS",
      "Overall": "2.0",
      "Content": "purchased march 8th and already called the tech. twice, and now my keyboard isn't typing proberly, keeps missing letters , not happy",
      "Date": "April 11, 2014"
    },
    {
      "Title": "compra",
      "Author": "jose quijada",
      "ReviewID": "R2ECL3POJ6ZV38",
      "Overall": "5.0",
      "Content": "Excellent product. I recommend it 100% good service fast delivery quality product. Recommended thank you very much. Genuine product. Guaranteed very economical and recommend them",
      "Date": "April 10, 2014"
    },
    {
      "Title": "A Great Buy for the price",
      "Author": "Carl",
      "ReviewID": "RPLPUG7U9WBOQ",
      "Overall": "5.0",
      "Content": "Work great ! I have NO complaints and for the price works excellent ! I would recommend this computer if you don't want to make a big investment.",
      "Date": "April 2, 2014"
    },
    {
      "Title": "Excellen",
      "Author": "Ernesto Torres",
      "ReviewID": "R3QNJK8CTWFGLE",
      "Overall": "5.0",
      "Content": "all came to my entire satisfaction, I can recommend widely to make their purchases hereby, all my products came to my entire satisfaction",
      "Date": "March 7, 2014"
    },
    {
      "Title": "great product, especially for the price",
      "Author": "Robert Wright",
      "ReviewID": "R3CEQJTDXAR66W",
      "Overall": "4.0",
      "Content": "This is a very good product, especially for the price that I paid. The only reason I am giving it 4 stars instaed of five is that at times the mouse freezes up(just have to wait about a minute then it works again) and that I do not like the start menu being away from the desktop but you have to be patient with new operating systems. other that that, a great buy",
      "Date": "February 24, 2014"
    },
    {
      "Title": "Its been great so Far!",
      "Author": "DaisyG7",
      "ReviewID": "R29AUPCD87SIHM",
      "Overall": "4.0",
      "Content": "The laptop has been great! If there was anything that gets less star review, its Windows 8!  Its not very Laptop friendly!  Thats why I rated it 4 stars, less 1 for the Windows 8. Other than that the Laptop gets a 5 Star Rating!",
      "Date": "April 18, 2013"
    },
    {
      "Title": "Windows 8 Eh,",
      "Author": "Lette85",
      "ReviewID": "R2KG8771L5CD4V",
      "Overall": "4.0",
      "Content": "Windows 8 is quite confusing, it seems like it was ONLY made for the computers that are touch screen, and it takes awhile to figure out where everything is. There is NO Start menu anymore, its more like lets try and find where everything is at. The computer its self, I really like. Has a few glitches but what computer don't? Battery is pretty good on this computer. Love the color, very pretty blue. If this computer was running a Windows 7, would be 5 stars, but I just can't wrap my hands around the windows 8, and I'm usually really good at technology... but without touch screen the apps seem pointless... I would recommended if your ok with Windows 8, or don't mind the challenge of trying to find everything again... Also, I want to note that the mouse pad is RUFF, so it takes awhile to get used to! it's not soft like normal ones, its got bumps so feels extremely weird at first.. took me about a week to get used to the feeling...",
      "Date": "March 19, 2013"
    },
    {
      "Title": "You Get What You Pay For...",
      "Author": "Kourtnee",
      "ReviewID": "R3B28CRMLE1UH0",
      "Overall": "3.0",
      "Content": "I had previously had an HP Laptop I spent $1200.00 & It recently stopped working. I plan on returning to College soon & Enjoy using Skype to talk to my Sister in the Military. Due to my lack of Funds my Mother surprised me with this Laptop (Which shes still eating PB&J; today to make up for the Costs) Its Cheap but its still $300.00 out of pocket my Mother paid.LIKES: When it comes to using the Web Cam to talk to my Sister.. ITS AMAZING!!! This is BIG for me. Even in the dim light it you can see everything perfectly. Beyond my expectations.The Detail & Coloring on the Screen look very good as well as the Exterior. When I opened it, I wouldn't have guessed it was only $300.00. What a Gorgeous Laptop!!DISLIKES: The amount of time it freezes up is ridiculous... After a while it gets very irritating.I type fast & When writing my sister or anyone on Facebook, I cant see what im writing until I send it.Also.. The Skype App was already downloaded to my Windows 8.. But it was sooo difficult I couldn't use it. Wouldn't let me sign in or \"update\" it. So I had to download Skype to my Desktop. My curser takes a while to move sometimes which also goes along with the freezing up & Windows 8 is difficult to use or understand.Ive only used the Laptop a Week & Understand its not Top Notch Quality but I recommend someone to do their research before buying. Will update later after using the Laptop for longer.",
      "Date": "January 19, 2013"
    },
    {
      "Title": "HP REPAIR DEPT update",
      "Author": "mt \"mt\"",
      "ReviewID": "RFTVZQ152NPW3",
      "Overall": "5.0",
      "Content": "UPDATE:  11/27/13 =  After writing this review HP contacted me and ended up offering to fix my laptop!  The problem is there were no parts for my model any more.  So they REPLACED MY LAPTOP!  NO charge!  I could not be happier with HP customer service!I would still photograph all sides of any product I would send in the mail (with a current newspaper to show the date sent) just in case it gets broken outside of your control.THANKS HP!  (To repeat: I did not buy this particular item.)Original review:  BE FOREWARNED:  HP SERVICE / WARRANTY IS NOT RELIABLE!!!The story:  I have an HP laptop which I sent in for warranty checkup (fix some rubber screen bumpers, cleaning, fan noise, etc.)  On the way there or at HP, it got damaged, which they claim was my doing and wanted $128 to fix it!  They were nice saying that was a ½ price offer!  But THEY caused the damage to the laptop!?  The reps said, \"Do you have pictures of the laptop?\"  Ha!  So when I refused to pay and it was returned, it would not even turn on!  I had a professional engineer open it and he said it must have been violently dropped as the CPU had come unseated.  Also they cracked the hinge on one side, so I couldn't close the lid w/o snapping the screen off.  I wrote a letter to the head of marketing and his assistant called back.  He offered me a nominal amount to trade up to another new laptop.  I declined as it wasn't a reasonable offer.  So be forewarned:  IF you get an HP product, the repair dept. may break it and the company will NOT fix it.  They will blame you.  IF you do send it in for repair, take a dozen photos from every angle as you'd have some proof.  I'd take a picture of the box just before you send it as well.  I have had 2 laptops, a camera, and printers from HP.  Never again.  I also sold my shares of HP stock!  BUYER BEWARE!  WORST CUSTOMER SERVICE EXPERIENCE EVER! p.s.  I did not purchase this laptop.",
      "Date": "October 1, 2013"
    },
    {
      "Title": "Amazing set up!",
      "Author": "nathan horton",
      "ReviewID": "RG5B8APZFHVV7",
      "Overall": "5.0",
      "Content": "Windows 8 is amazing some people like it and some people dont, some people think it should be made for tablets, but its perfectly fine for me, it helps me keep my stuff more organized and everything! And the laptop its self is amazing!!!!! With 5 Exclamation Marks! Its fast, if you need it for work its great for you! If you need it to go on facebook, youtube Its amazing too! Im only 13, and i bought myself one because im tired of sitting at a desktop when i could be watching a movie in the living room on my facebook! Its nice portable, comfortable, and easy to carry around, I love the color on it, great HP logo on the front!",
      "Date": "May 15, 2013"
    },
    {
      "Title": "Love it",
      "Author": "Maria Perez",
      "ReviewID": "R29WSR8S3AO4Y",
      "Overall": "5.0",
      "Content": "Really good product. I love it, It was exactelly what I was looking for.All I needed for my work.",
      "Date": "February 24, 2013"
    },
    {
      "Title": "Windows 8, not great",
      "Author": "Crocgrandma",
      "ReviewID": "R24WKI8VI5FFCG",
      "Overall": "2.0",
      "Content": "Bought as a gift, not the greatest, but was very cheap. Only Windows 8, which is new and not the easiest to get used to. Not enough software in it.",
      "Date": "December 6, 2013"
    },
    {
      "Title": "hp 2000 laptop",
      "Author": "Shelia Henry",
      "ReviewID": "R2P853VA9ZY0NG",
      "Overall": "3.0",
      "Content": "I like this laptop, though at times it sometimes freeze up on with the mouse.  But for the most part, for the price I thought its a pretty good laptop.  I like HP's over Dell.  I would purchase another Hp.....This was purchase from a third party vendor.  Overall pretty good.",
      "Date": "October 30, 2013"
    },
    {
      "Title": "I think it is 4 star",
      "Author": "Ronnie Jones",
      "ReviewID": "R3G5C9YVJ5EQ7C",
      "Overall": "4.0",
      "Content": "it is doing good.  I just wish every thing didn't have to have a password  I just wish it didn't take so long to do anything",
      "Date": "July 29, 2013"
    },
    {
      "Title": "For the price, I guess it's good for something",
      "Author": "davidlevang",
      "ReviewID": "R250Q5ESAFURBQ",
      "Overall": "2.0",
      "Content": "I own an insurance brokerage and I wanted a little something to make me a bit more portable. I figured for $279, I couldn't go wrong with this 15\" screen, 320GB hardrive and 1.4GHZ proc with 4GB of RAM.  I was wrong though.  If you're just looking to surf the web, this might be fine, but if you're looking to do anything technical or anything that requires speed, this isn't the laptop for you.  You may ask, who would this laptop be good for? Answer: Grandma and Grandpa who only check email and occasional web surfing and have plenty of waiting time on their hands.All in all, if you don't mind waiting for things to load, you'd be fine, but trust me, I would spend $400-$500 before I'd buy this laptop again.  I ended up buying the DELL XPS13 netbook.  About $800... It was worth it!",
      "Date": "June 21, 2013"
    },
    {
      "Title": "Don't Buy It",
      "Author": "Matthew BLoom",
      "ReviewID": "R2P23IZEQTWE84",
      "Overall": "1.0",
      "Content": "I'm not quite sure how I mistakenly ordered this laptop but I was looking for something with a bit more power. I feel I was somehow tricked or re-directed into ordering this one. After looking at a number of different machines I settled on this one because of the price/specs. When I received the laptop I discovered that the processor was a measly 1.3GHz with 1.6GB of Ram. Unless you plan on performing the most basic tasks (sending email, etc...) then this laptop is worthless. I've also noticed some of the strange behavior that other posters have commented on such as: inexplicably switching to windows 8 tiles mode or just generally acting very buggy. There is something seriously deceiving about the quality represented with this laptop. You get what you pay for. I will be returning it tomorrow.",
      "Date": "May 23, 2013"
    },
    {
      "Title": "There are better options, even for a budget PC",
      "Author": "passat driver",
      "ReviewID": "R3561TAZEYFDH7",
      "Overall": "3.0",
      "Content": "I bought this laptop at Wal-Mart for $278 6 months ago.  With a 2 year extended warranty, it was still cheaper than Amazon and is still available at Wal-Mart.  I understand the limitations of this machine and I bought it thinking that word processing and web browsing were my major computing activities.  However, compared to other laptops, this model is slow at every task.  So slow that tech support acknowledged it, even with constant firmware and bios updates.  I added 8GB of RAM(removed the stock 2GB--8GB is max, which limits its future potential) and the speed improved enough to be useful at school but it is embarrassing slow.  The fan is not loud, but it is noticeable.  The keyboard is slippery and the mouse is too sensitive--but you'll get over these things.  Web browsing (any browser) is slower than my iMac and any of the PC's at school.  It's enough to get basic jobs done but the speed is frustratingly slow.  In hindsight, impulse buying this laptop was not a good decision for me because I had to spend almost another $40 for RAM.  I recommend checking out dealnews.com, dealigg.com, newegg.com woot.com or any price comparison website before buying this laptop.",
      "Date": "May 17, 2013"
    },
    {
      "Title": "excellent",
      "Author": "Elio Dommar",
      "ReviewID": "RP254B5UUN3FB",
      "Overall": "5.0",
      "Content": "excellent article, very practical, very fast modern yy. From all points of view is excellent I recommend it to anyone interested in purchasing it",
      "Date": "February 24, 2014"
    },
    {
      "Title": "Dont buy HP products",
      "Author": "Dizzy Daddy",
      "ReviewID": "R2WPXR2KBYQD6X",
      "Overall": "1.0",
      "Content": "i have purchase this product thinking it would be great. but after 2 months of using, it crashed on me keeps over heating. and i have been asking question about the quality of HP products to some of my friends they told me that don't ever buy HP products they're cheaply made and will not last long. yes the price is cheap but you better off buying a high quality laptop that will last for years. never again buying  HP products.",
      "Date": "September 26, 2013"
    },
    {
      "Title": "Liked this until I found out what a pain it is to use, plus most of my software needed to be updated, and some had none.",
      "Author": "usa67us \"usa67us\"",
      "ReviewID": "R3UYE7CSYB9AYJ",
      "Overall": "2.0",
      "Content": "update:  I absolutely HATE Windows 8!!  Liked this until I found out what a pain it is to use, plus most of my software needed to be updated, and some had none.  In my opinion, I would rather use Windows 3.5!!",
      "Date": "August 31, 2013"
    },
    {
      "Title": "Great laptop for a great price!",
      "Author": "renee",
      "ReviewID": "R37P3JQTWJ2B36",
      "Overall": "5.0",
      "Content": "I'm so happy with the fast delivery, the extremely low price for a product worth much more money.Very Happy",
      "Date": "July 24, 2013"
    },
    {
      "Title": "A good deal",
      "Author": "Yaiuglig",
      "ReviewID": "R4WR5JE0DBZVG",
      "Overall": "5.0",
      "Content": "This HP 2000 laptop satisfy my expectation as to have a laptop that could do multitasking especially when do video downloading and at the same time work on my music tracks and do other stuffs like surfing the net and converting videos as well as audio with a very effective speed. I used to own a Toshiba laptop with a 2.0 GHz processor speed but it does not produce what this laptop gives with only 1.3GHz. Plus it has a fair price.  As of now my laptop is still running smoothly. I would recommend buying it.",
      "Date": "July 23, 2013"
    },
    {
      "Title": "HP comp",
      "Author": "Tracy",
      "ReviewID": "R2YNXHWPHR2JW1",
      "Overall": "2.0",
      "Content": "I have had nothing but problems with this computer since we received it... it has lines that continuously run through the screen and it runs extremely slow and freezes up constantly... I don't know if its the make of the laptop itself, or if it hasn't been refurbished properly... I wouldn't recommend this to anyone, but each has his own way of working things as well as likes and dislikes.. Good-luck!",
      "Date": "June 25, 2013"
    },
    {
      "Title": "If  You Know the Charm to Keep windows 8 away, USE IT!",
      "Author": "Marilyn Kircus",
      "ReviewID": "R1K3Q9CQC4ASB1",
      "Overall": "1.0",
      "Content": "If I could choose a negative 8, I would have used it. I've had this computer 6 terrible weeks and now it is in a repair shop.  I don't know if it's just the software or also the hardware.  But I've already had to replace the card reader driver, which took me and two different Indians, with different plans for the fix about 6 hours to get it fixed. The computer lost the first guy somehow which necessitated the second one. At least he noticed that the first had had me add some new software which he removed and added it back automatically, or I would have been working several more hours.And Windows 8, - where to start - it takes a few more clicks to just turn it off and I still can't find a way to close down open windows. resolution is always in a flux - getting bigger until most everything is off the screen or going down to microscopic level.  I think my blood pressure has gone up 20 points, just trying to deal with ordinary everyday, supposedly automatic uses of the computer.So I'm not impressed with the computer and really can't stand Windows 8.  It seems like a giant advertising tool and I'm still trying to get their backup company to leave me alone.",
      "Date": "June 22, 2013"
    },
    {
      "Title": "Awesome",
      "Author": "Jack Rickey",
      "ReviewID": "RD20WFL9P0V41",
      "Overall": "5.0",
      "Content": "Great laptop for 375 it exceeds my expectations plus Windows 8 is easier to use and fast to learn everything about it",
      "Date": "June 19, 2013"
    }
  ]
}
